//--створити масив та вивести його в консоль:

//- з 5 числових значень
let arr1 = [1, 2, 3, 4.5, 6.7];
//console.log(arr1);

//- з 5 стічкових значень
let arr2 = ['ok', 'ten', 'web', 'univer', 'sity'];
//console.log(arr2);

//- з 5 значень стрічкового, числового та булевого типу
let arr3 = ['ok', 10, 'web', true, 2.9];
//console.log(arr3);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let arr4 = [];
arr4[0] = 10;
arr4[1] = 'ten';
arr4[2] = true;
arr4[3] = 4;
arr4[5] = true;
//console.log(arr4);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
for(let i=0; i<10; i++){
    //document.write(`<div>oktenweb<div/>`)
}

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
for(let i=0; i<10; i++){
    //document.write(`<div>index = ${i}<div/>`)
}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
let i = 0;
while (i < 20){
    //document.write(`<h1>Block h1<h1/>`);
    i++;
}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
i = 0;
while (i < 20){
    //document.write(`<h1>Block h1 index = ${i}<h1/>`);
    i++;
}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let arr5 = [1, 2, 3, 4.5, 6.7, 8, 9, 10.11, 12.13, 14];
for(i=0; i < arr5.length; i++){
    //console.log(arr5[i]);
}

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let arr6 = ['AB', 'BC', 'CD', 'DE', 'EF', 'FG', 'GH', 'HM', 'MN', 'NK'];
for(i=0; i < arr6.length; i++){
    //console.log(arr6[i]);
}

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
let arr7 = ['AB', true, 'CD', 'DE', [1, 2, 3, 4], 'FG', 5, 'HM', {name: 'Vitalii', age: 19}, 'NK'];
for(i=0; i < arr7.length; i++){
    //console.log(arr7[i]);
}

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
let arr8 = [10, 'true', true, 2, false, 'false', 15, true, false];
for(i=0; i<arr8.length; i++){
    if((typeof arr8[i]) === 'boolean'){
        //console.log("Index " + i + " : " + arr8[i]);
    }
}

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
let arr9 = [10, 'true', true, 2, false, 'false', 15, true, false, 9999, 0.2];
for(i=0; i<arr9.length; i++) {
    if ((typeof arr9[i]) === 'number') {
        //console.log("Index " + i + " : " + arr9[i]);
    }
}

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
let arr10 = [10, 'true', true, 2, 'okten', 'false', 15, true, 'web', 9999, 0.2];
for(i=0; i<arr10.length; i++) {
    if ((typeof arr10[i]) === 'string') {
        //console.log("Index " + i + " : " + arr10[i]);
    }
}

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
let arr11 = [];
arr11[0] = 10;
arr11[1] = [1, 2, 3];
arr11[2] = {name: 'Vitalii', age: 19};
arr11[3] = ['one', 'two', 'three'];
arr11[4] = false;
arr11[5] = 15;
arr11[6] = [true, false, 'true'];
arr11[7] = 'okten';
arr11[8] = -0.9874;
arr11[9] = 85;
for(i = 0; i < arr11.length; i++){
    //console.log(arr11[i]);
}
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for(i = 0; i < 10; i++){
    //document.write('крок ' + i + '-ий' + '<br>');
    //console.log('крок ' + i + '-ий');
}

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for(i = 0; i < 100; i++){
    //document.write('крок ' + i + '-ий' + '<br>');
    //console.log('крок ' + i + '-ий');
}
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
for(i = 0; i < 200; i+=2){
    //document.write('крок ' + i + '-ий' + '<br>');
    //console.log('крок ' + i + '-ий');
}

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
for(i = 0; i < 100; i++){
    if( (i % 2) === 0) {
        //document.write('крок ' + i + '-ий' + '<br>');
        //console.log('крок ' + i + '-ий');
    }
}

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
for(i = 0; i < 100; i++){
    if( (i % 2) === 1) {
        //document.write('крок ' + i + '-ий' + '<br>');
        //console.log('крок ' + i + '-ий');
    }
}

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
for(let minute = 1; minute < 3; minute++){
    for(let second = 0; second < 60; second++){
        if((second/10) < 1){
            //console.log('12:0' + minute + ':0' + second);
        } else{
            //console.log('12:0' + minute + ':' + second);
        }
    }
}

// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
for(let hour = 0; hour < 2; hour++){
    for(minute = 0; minute < 60; minute++){
        if(hour === 1 && minute === 20){
            break;
        }
        for(second = 0; second < 60; second++){
            if((minute/10) < 1){
                if((second/10) < 1){
                    //console.log('0' + hour + ':0' + minute + ':0' + second);
                } else{
                    //console.log('0' + hour + ':0' + minute + ':' + second);
                }
            } else{
                if((second/10) < 1){
                    //console.log('0'+ hour +':' + minute + ':0' + second);
                } else{
                    //console.log('0' + hour + ':' + minute + ':' + second);
                }
            }

        }
    }
}

// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
let arr12 = ['a', 'b', 'c'];
let word = '';
for(i = 0; i < 3; i++){
    //word += arr12[i];
}
//console.log(word);
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
word = '';
i = 0;
while(i < 3){
    //word += arr12[i];
    i++;
}
//console.log(word);
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
word = '';
for(let symbol of arr12){
    word += symbol;
}
//console.log(word);

//
// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//

// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18] та:
let array = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// 1. перебрати його циклом while
let index=0;
while (index < array.length){
    //console.log(array[index]);
    index++;
}

// 2. перебрати його циклом for
for(index = 0; index < array.length; index++){
    //console.log(array[index]);
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
index=0;
while (index < array.length){
    if((index % 2) === 1){
        //console.log(array[index]);
    }
    index++;
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for(index = 0; index < array.length; index++){
    if((index % 2) === 1){
        //console.log(array[index]);
    }
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення
index=0;
while (index < array.length){
    if((index % 2) === 0){
        //console.log(array[index]);
    }
    index++;
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення
for(index = 0; index < array.length; index++){
    if((index % 2) === 0){
        //console.log(array[index]);
    }
}

// 7. замінити кожне число кратне 3 на слово "okten"
for(index = 0; index < array.length; index++){
    if((array[index] % 3) === 0){
        array[index] = 'okten';
        //console.log(array[index]);
    }
}

// 8. вивести масив в зворотньому порядку.
for(index = array.length-1; index >= 0; index--){
    //console.log(array[index]);
}

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)


// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
let array_even = [];
let value = 0;
for(i = 0; i < 50; i++){
    array_even[i] = value;
    value+=2;
}
//console.log(array_even);

// - заповнити його 50 непарними числами за допомоги циклу.
let array_odd = [];
value = 1;
for(i = 0; i < 50; i++){
    array_odd[i] = value;
    value+=2;
}
//console.log(array_odd);


//
// 1
//  створити пустий масив та :
// 1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//  2. вывести на консоль  каждый третий елемент
//  3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.
//  4. вывести на консоль  каждый третий елемент
//  но при условии что он имеет парное значение и
//  записать их в другой массив.
//  5. Вывести каждый елемент массива у которого соседний с права элемент - парный
//   5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
//
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.